src/InformationRegisters/ГраницыЗапретаИзмененияДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ГраницыЗапретаИзмененияДанных</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ГраницаЗапретаИзменений</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Constants/ДатаЗаявкиСоздаютсяВ83/Ext/ValueManagerModule.bsl
Процедура ПриЗаписи(Отказ)
	глЗначениеПеременнойУстановить("ДатаЗаявкиСоздаютсяВ83", Значение, Истина);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	СтароеЗначение = Константы.ДатаЗаявкиСоздаютсяВ83.Получить();
	Если Значение <> СтароеЗначение Тогда 
		//Меняем глобальную дату запрета и по организациям
		Набор = РегистрыСведений.ГраницыЗапретаИзмененияДанных.СоздатьНаборЗаписей();
		Набор.Отбор.Организация.Установить(Справочники.Организации.ПустаяСсылка());
		Запись = Набор.Добавить();
		Запись.ГраницаЗапретаИзменений = Значение - 24*60*60;
		Запись.Организация = Справочники.Организации.ПустаяСсылка();
		Набор.Записать();
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	Организации.Ссылка КАК Организация
		               |ИЗ
		               |	Справочник.Организации КАК Организации";
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл 
			Набор = РегистрыСведений.ГраницыЗапретаИзмененияДанных.СоздатьНаборЗаписей();
			Набор.Отбор.Организация.Установить(Выборка.Организация);
			Запись = Набор.Добавить();
			Запись.ГраницаЗапретаИзменений = Значение - 24*60*60;
			Запись.Организация = Выборка.Организация;
			Набор.Записать();
		КонецЦикла;
		
		Сообщить("Обновлены границы запрета редактирования данных. Изменения вступят в силу после перезапуска");
	КонецЕсли;

КонецПроцедуры
